from fastapi import APIRouter

router = APIRouter()

# รายการประเภทคดี
CASE_TYPES = [
    "1.คดีไม่เข้า พรก.",
    "2.หลอกลวงซื้อขายสินค้าหรือบริการ ที่ไม่มีลักษณะเป็นขบวนการ",
    "3.หลอกลวงเป็นบุคคลอื่นเพื่อยืมเงิน",
    "4.หลอกลวงให้รักแล้วโอนเงิน (Romance Scam)",
    "5.หลอกลวงให้โอนเงินเพื่อรับรางวัลหรือวัตถุประสงค์อื่นๆ",
    "6.หลอกลวงให้กู้เงินอันมีลักษณะฉ้อโกง กรรโชก หรือรีดเอาทรัพย์",
    "7.หลอกลวงให้โอนเงินเพื่อทำงานหารายได้พิเศษ",
    "8.ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน",
    "9.หลอกลวงให้ติดตั้งโปรแกรมควบคุมระบบในเครื่องโทรศัพท์",
    "10.กระทำต่อระบบหรือข้อมูลคอมพิวเตอร์โดยผิดกฎหมาย (Hacking) เพื่อฉ้อโกง กรรโชก หรือรีดเอาทรัพย์",
    "11.เข้ารหัสข้อมูลคอมพิวเตอร์ของผู้อื่นโดยมิชอบเพื่อกรรโชก หรือรีดเอาทรัพย์ (Ransomware)",
    "12. หลอกลวงให้ลงทุนผ่านระบบคอมพิวเตอร์",
    "13.หลอกลวงเกี่ยวกับสินทรัพย์ดิจิทัล",
    "14.หลอกลวงซื้อขายสินค้าหรือบริการ ที่มีลักษณะเป็นขบวนการ",
    "15.หลอกลวงให้ลงทุนที่เป็นความผิดตาม พ.ร.ก.กู้ยืมเงินฯ",
    "16.คดีอาชญากรรมทางเทคโนโลยีทางลักษณะอื่นๆ",
    "17.พนันออนไลน์"
]

@router.get("/case-types")
def get_case_types():
    """Get list of available case types"""
    return {"case_types": CASE_TYPES}
